ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_Display.cpp
    /* Configures the frame buffer line number */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLNR &= ~(LTDC_LxCFBLNR_CFBLNBR);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLNR = (pLayerCfg->ImageHeight);

    /* Enable LTDC_Layer by setting LEN bit */
    LTDC_LAYER(hltdc, LayerIdx)->CR |= (uint32_t)LTDC_LxCR_LEN;
}


void STM32F4_Ltdc_LayerConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
    /* Copy new layer configuration into handle structure */
    hltdc->LayerCfg[LayerIdx] = *pLayerCfg;

    /* Configure the LTDC Layer */
    STM32F4_Ltdc_SetConfiguration(hltdc, pLayerCfg, LayerIdx);

    /* Sets the Reload type */
    hltdc->Instance->SRCR = LTDC_SRCR_IMR;

}

bool STM32F4_Display_Initialize() {
    // InitializeConfiguration
    static LTDC_HandleTypeDef hltdc_F;
    LTDC_LayerCfgTypeDef      pLayerCfg;

    const uint32_t STM32F4_DISPLAY_CLOCKDIVS[4] = { 2, 4, 8, 16 };

    uint32_t pll_saiIn;
    uint32_t pll_saiQ;
    uint32_t pll_saiP;
    uint32_t pll_saiR;

    uint32_t div;
    uint32_t clockMHz;

    RCC->CR &= ~(RCC_CR_PLLSAION);

    pll_saiQ = (RCC->PLLSAICFGR >> 24) & 0x0F;
    pll_saiP = (RCC->PLLSAICFGR >> 16) & 0x03;

    pll_saiR = 2;

    div = 0;

    pll_saiIn = STM32F4_SYSTEM_CLOCK_HZ / 1000000; // In MHz

    while (true) {
        clockMHz = (pll_saiIn / pll_saiR) / STM32F4_DISPLAY_CLOCKDIVS[div];

        if (clockMHz > (STM32F4_Display_GetPixelClockDivider() / 1000)) {
            pll_saiR++;

            if (pll_saiR > 7) {
                pll_saiR = 7;
                div++;
            }

            if (div > 3) {
                // clk is not in range, set default
                // 216 / 5 / STM32F4_DISPLAY_CLOCKDIVS[div] = 216 / 5 / 4 = 10.8MHz
                div = 1;
                pll_saiR = 5;
                break;
            }
        }
        else {
            // Found good clk
            break;
        }
    }

    STM32F4_Time_Delay(nullptr, 0x10000);

    RCC->PLLSAICFGR = ((pll_saiIn) << 6) | ((pll_saiP) << 16) | ((pll_saiQ) << 24) | ((pll_saiR) << 28);

    MODIFY_REG(RCC->DCKCFGR1, RCC_DCKCFGR1_PLLSAIDIVR, (uint32_t)(div << 16));

    RCC->CR |= (RCC_CR_PLLSAION);

    STM32F4_Time_Delay(nullptr, 0x10000);

    RCC->APB2ENR |= RCC_APB2ENR_LTDCEN;

    //HorizontalSyncPolarity
    if (m_STM32F4_DisplayHorizontalSyncPolarity == false)
        hltdc_F.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    else
        hltdc_F.Init.HSPolarity = LTDC_HSPOLARITY_AH;
    //VerticalSyncPolarity
    if (m_STM32F4_DisplayVerticalSyncPolarity == false)
        hltdc_F.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    else
        hltdc_F.Init.VSPolarity = LTDC_VSPOLARITY_AH;

    //OutputEnablePolarity
    if (m_STM32F4_DisplayOutputEnablePolarity == false)
        hltdc_F.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    else
        hltdc_F.Init.DEPolarity = LTDC_DEPOLARITY_AH;

    //OutputEnablePolarity
    if (m_STM32F4_DisplayPixelPolarity == false)
        hltdc_F.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    else
        hltdc_F.Init.PCPolarity = LTDC_GCR_PCPOL;

    /* The RK043FN48H LCD 480x272 is selected */
    /* Timing Configuration */
    hltdc_F.Init.HorizontalSync = (m_STM32F4_DisplayHorizontalSyncPulseWidth - 1);
    hltdc_F.Init.VerticalSync = (m_STM32F4_DisplayVerticalSyncPulseWidth - 1);
    hltdc_F.Init.AccumulatedHBP = (m_STM32F4_DisplayHorizontalSyncPulseWidth + m_STM32F4_DisplayHorizontalBackPorch - 1);
    hltdc_F.Init.AccumulatedVBP = (m_STM32F4_DisplayVerticalSyncPulseWidth + m_STM32F4_DisplayVerticalBackPorch - 1);
    hltdc_F.Init.AccumulatedActiveH = (m_STM32F4_DisplayHeight + m_STM32F4_DisplayVerticalSyncPulseWidth + m_STM32F4_DisplayVerticalBackPorch - 1);
    hltdc_F.Init.AccumulatedActiveW = (m_STM32F4_DisplayWidth + m_STM32F4_DisplayHorizontalSyncPulseWidth + m_STM32F4_DisplayHorizontalBackPorch - 1);
    hltdc_F.Init.TotalHeigh = (m_STM32F4_DisplayHeight + m_STM32F4_DisplayVerticalSyncPulseWidth + m_STM32F4_DisplayVerticalBackPorch + m_STM32F4_DisplayVerticalFrontPorch - 1);
    hltdc_F.Init.TotalWidth = (m_STM32F4_DisplayWidth + m_STM32F4_DisplayHorizontalSyncPulseWidth + m_STM32F4_DisplayHorizontalBackPorch + m_STM32F4_DisplayHorizontalFrontPorch - 1);
    /* Layer1 Configuration ------------------------------------------------------*/

    /* Windowing configuration */
    /* In this case all the active display area is used to display a picture then :
     Horizontal start = horizontal synchronization + Horizontal back porch = 43
     Vertical start   = vertical synchronization + vertical back porch     = 12
     Horizontal stop = Horizontal start + window width -1 = 43 + 480 -1
     Vertical stop   = Vertical start + window height -1  = 12 + 272 -1      */
    pLayerCfg.WindowX0 = 0;
    pLayerCfg.WindowX1 = m_STM32F4_DisplayWidth;
    pLayerCfg.WindowY0 = 0;
    pLayerCfg.WindowY1 = m_STM32F4_DisplayHeight;

    /* Configure R,G,B component values for LCD background color : all black background */
    hltdc_F.Init.Backcolor.Blue = 0;
    hltdc_F.Init.Backcolor.Green = 0;
    hltdc_F.Init.Backcolor.Red = 0;

    hltdc_F.Instance = LTDC;

    /* Pixel Format configuration*/
    pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;

    /* Start Address configuration : frame buffer is located at FLASH memory */
    if (m_STM32F4_Display_VituralRam == nullptr)
        return false;

    pLayerCfg.FBStartAdress = (uint32_t)m_STM32F4_Display_VituralRam;

    /* Alpha constant (255 == totally opaque) */
    pLayerCfg.Alpha = 255;

    /* Default Color configuration (configure A,R,G,B component values) : no background color */
    pLayerCfg.Alpha0 = 0; /* fully transparent */
    pLayerCfg.Backcolor.Blue = 0;
    pLayerCfg.Backcolor.Green = 0;
    pLayerCfg.Backcolor.Red = 0;

    /* Configure blending factors */
    pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
    pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;

    /* Configure the number of lines and number of pixels per line */
    pLayerCfg.ImageWidth = pLayerCfg.WindowX1;
    pLayerCfg.ImageHeight = pLayerCfg.WindowY1;

    /* Configure the LTDC */
    if (!STM32F4_Ltdc_Initialize(&hltdc_F)) {
        return false;
    }

    /* Configure the Layer*/
    STM32F4_Ltdc_LayerConfiguration(&hltdc_F, &pLayerCfg, 1);

