ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_Display.cpp
        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F4_Display_Disable(const TinyCLR_Display_Controller* self) {
    STM32F4_Display_Uninitialize();

    m_STM32F4_DisplayEnable = false;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Display_SetConfiguration(const TinyCLR_Display_Controller* self, TinyCLR_Display_DataFormat dataFormat, uint32_t width, uint32_t height, const void* configuration) {
    if (dataFormat != TinyCLR_Display_DataFormat::Rgb565) return TinyCLR_Result::NotSupported;

    m_STM32F4_DisplayWidth = width;
    m_STM32F4_DisplayHeight = height;

    if (configuration != nullptr) {
        auto& cfg = *(const TinyCLR_Display_ParallelConfiguration*)configuration;

        m_STM32F4_DisplayOutputEnableIsFixed = cfg.DataEnableIsFixed;
        m_STM32F4_DisplayOutputEnablePolarity = cfg.DataEnablePolarity;
        m_STM32F4_DisplayPixelPolarity = cfg.PixelPolarity;

        m_STM32F4_DisplayPixelClockRateKHz = cfg.PixelClockRate / 1000;

        m_STM32F4_DisplayHorizontalSyncPolarity = cfg.HorizontalSyncPolarity;

        m_STM32F4_DisplayHorizontalSyncPulseWidth = cfg.HorizontalSyncPulseWidth;
        m_STM32F4_DisplayHorizontalFrontPorch = cfg.HorizontalFrontPorch;
        m_STM32F4_DisplayHorizontalBackPorch = cfg.HorizontalBackPorch;

        m_STM32F4_DisplayVerticalSyncPolarity = cfg.VerticalSyncPolarity;

        m_STM32F4_DisplayVerticalSyncPulseWidth = cfg.VerticalSyncPulseWidth;
        m_STM32F4_DisplayVerticalFrontPorch = cfg.VerticalFrontPorch;
        m_STM32F4_DisplayVerticalBackPorch = cfg.VerticalBackPorch;

        switch (dataFormat) {
        case TinyCLR_Display_DataFormat::Rgb565:
            m_STM32F4_DisplayBufferSize = width * height * 2;
            break;

        default:
            // TODO 8 - 24 - 32 bits
            break;
        }

        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        if (m_STM32F4_Display_VituralRam != nullptr) {
            memoryProvider->Free(memoryProvider, m_STM32F4_Display_VituralRam);

            m_STM32F4_Display_VituralRam = nullptr;
        }

        m_STM32F4_Display_VituralRam = (uint16_t*)((uint8_t*)memoryProvider->Allocate(memoryProvider, m_STM32F4_DisplayBufferSize));

        if (m_STM32F4_Display_VituralRam == nullptr) {
            return TinyCLR_Result::OutOfMemory;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Display_GetConfiguration(const TinyCLR_Display_Controller* self, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) {
    dataFormat = TinyCLR_Display_DataFormat::Rgb565;
    width = m_STM32F4_DisplayWidth;
    height = m_STM32F4_DisplayHeight;

    if (configuration != nullptr) {
        auto& cfg = *(TinyCLR_Display_ParallelConfiguration*)configuration;

        cfg.DataEnableIsFixed = m_STM32F4_DisplayOutputEnableIsFixed;
        cfg.DataEnablePolarity = m_STM32F4_DisplayOutputEnablePolarity;
        cfg.PixelPolarity = m_STM32F4_DisplayPixelPolarity;

        cfg.PixelClockRate = m_STM32F4_DisplayPixelClockRateKHz * 1000;

        cfg.HorizontalSyncPolarity = m_STM32F4_DisplayHorizontalSyncPolarity;

        cfg.HorizontalSyncPulseWidth = m_STM32F4_DisplayHorizontalSyncPulseWidth;
        cfg.HorizontalFrontPorch = m_STM32F4_DisplayHorizontalFrontPorch;
        cfg.HorizontalBackPorch = m_STM32F4_DisplayHorizontalBackPorch;

        cfg.VerticalSyncPolarity = m_STM32F4_DisplayVerticalSyncPolarity;

        cfg.VerticalSyncPulseWidth = m_STM32F4_DisplayVerticalSyncPulseWidth;
        cfg.VerticalFrontPorch = m_STM32F4_DisplayVerticalFrontPorch;
        cfg.VerticalBackPorch = m_STM32F4_DisplayVerticalBackPorch;

        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F4_Display_DrawBuffer(const TinyCLR_Display_Controller* self, uint32_t x, uint32_t y, uint32_t width, uint32_t height, const uint8_t* data) {
    STM32F4_Display_BitBltEx(x, y, width, height, (uint32_t*)data);
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Display_DrawString(const TinyCLR_Display_Controller* self, const char* data, size_t length) {
    for (size_t i = 0; i < length; i++)
        STM32F4_Display_WriteFormattedChar(data[i]);

    return TinyCLR_Result::Success;
}

TinyCLR_Display_DataFormat dataFormats[] = { TinyCLR_Display_DataFormat::Rgb565 };

TinyCLR_Result STM32F4_Display_GetCapabilities(const TinyCLR_Display_Controller* self, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {
    type = TinyCLR_Display_InterfaceType::Parallel;
    supportedDataFormatCount = SIZEOF_ARRAY(dataFormats);
    supportedDataFormats = dataFormats;

    return TinyCLR_Result::Success;
}

void STM32F4_Display_AddApi(const TinyCLR_Api_Manager* apiManager) {
    for (auto i = 0; i < TOTAL_DISPLAY_CONTROLLERS; i++) {
        displayControllers[i].ApiInfo = &displayApi[i];
        displayControllers[i].Acquire = &STM32F4_Display_Acquire;
        displayControllers[i].Release = &STM32F4_Display_Release;
        displayControllers[i].Enable = &STM32F4_Display_Enable;
        displayControllers[i].Disable = &STM32F4_Display_Disable;
        displayControllers[i].SetConfiguration = &STM32F4_Display_SetConfiguration;
        displayControllers[i].GetConfiguration = &STM32F4_Display_GetConfiguration;
        displayControllers[i].GetCapabilities = &STM32F4_Display_GetCapabilities;
        displayControllers[i].DrawBuffer = &STM32F4_Display_DrawBuffer;
        displayControllers[i].DrawString = &STM32F4_Display_DrawString;

        displayApi[i].Author = "GHI Electronics, LLC";
        displayApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.STM32F4.DisplayController";
        displayApi[i].Type = TinyCLR_Api_Type::DisplayController;
        displayApi[i].Version = 0;
        displayApi[i].Implementation = &displayControllers[i];
        displayApi[i].State = nullptr;
    }

    m_STM32F4_Display_VituralRam = nullptr;

    
}

void STM32F4_Display_Reset() {
    STM32F4_Display_Clear();

    if (m_STM32F4_DisplayEnable)
        STM32F4_Display_Release(&displayControllers[0]);

    m_STM32F4_DisplayEnable = false;
}
#endif
